vlm/base/BusinessProcesses/бит_СогласованиеАктОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>бит_СогласованиеАктОБраке</Name>
			<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
			<BasedOn>
				<xr:Item>Document.бит_АктОБраке</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_АктОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность задач точки действия Выполнить для исполнителя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рецензии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Рецензент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рецензия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоследовательностьЭтапов</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

vlm/base/InformationRegisters/бит_ОчередностьЭтаповСогласований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ОчередностьЭтаповСогласований</Name>
			<Comment>Первыйбит ЛТ29 ЛапшовГ "GVLapshov@1cbit.ru" 06.012.2024</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>бит_НомерЭтапа</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_СтатусДокумента</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусыОБраке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_Цех</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>бит_РольИсполнителя</Name>
					<Comment>Первыйбит ЛТ24 ЛапшовГ "GVLapshov@1cbit.ru" 06.12.2024</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/Enums/бит_СтатусыОБраке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СтатусыОБраке</Name>
			<Comment>ЛТ9.5</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктСформированСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформленМастером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненРасчетМатериаловТехнолог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненРасчетНормировщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованНачальникомЦеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформленБухгалтером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотренНаКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/base/BusinessProcesses/бит_СогласованиеАктОБраке/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Дата согласования должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru = 'Дата согласования должна быть не меньше даты бизнес-процесса %Дата%';
							|en = 'Approval date must not be earlier than the business process date %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Предмет) Тогда
		
		ИмяТаблицы = Предмет.Метаданные().ПолноеИмя();
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|&ПоляПоТаблице,
			|	ДокументПредмет.Статус КАК Статус,
			|	ДокументПредмет.Ссылка КАК Предмет
			|ИЗ
			|	&ИмяТаблицы КАК ДокументПредмет
			|ГДЕ
			|	ДокументПредмет.Ссылка = &Предмет
			|");
		
			
			ПоляПоТаблице = "
			|	ВЫБОР
			|		КОГДА
			|			ДокументПредмет.Проведен И ДокументПредмет.Статус <> ЗНАЧЕНИЕ(Перечисления.бит_СтатусыОБраке.АктСформированСК)
			|		ТОГДА
			|			ИСТИНА
			|		ИНАЧЕ
			|			ЛОЖЬ
			|	КОНЕЦ КАК ЕстьОшибкиСогласован,
			|	ВЫБОР
			|		КОГДА
			|			НЕ ДокументПредмет.Проведен
			|		ТОГДА
			|			ИСТИНА
			|		ИНАЧЕ
			|			ЛОЖЬ
			|	КОНЕЦ КАК ЕстьОшибкиПроведен,
			|
			|";
				
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляПоТаблице,", ПоляПоТаблице);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы);
			
		Запрос.УстановитьПараметр("Предмет", Предмет);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		// Документ не проведен - нет смысла начинать согласование
		Если Выборка.ЕстьОшибкиПроведен Тогда
			
			ТекстОшибки = НСтр("ru = 'Согласование не может быть начато, т.к. документ %ДокументПредмет% не проведен';
								|en = 'Cannot start approval because document %ДокументПредмет% is not posted'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДокументПредмет%", Выборка.Предмет);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Предмет",
				,
				Отказ);
				
			Возврат;
			
		// Документ уже согласован - нет смысла начинать согласование
		ИначеЕсли Выборка.ЕстьОшибкиСогласован Тогда
			
			ТекстОшибки = НСтр("ru = '%Предмет% в статусе ""%Статус%"" не может начать процес повторно!';
								|en = '%Предмет% with the ""%Статус%"" status does not require approval'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Предмет%", Выборка.Предмет);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Статус%",  Выборка.Статус);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"Предмет",
				,
				Отказ);
				
			Возврат;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.бит_АктОБраке") Тогда
		ЗаполнитьБизнесПроцессНаОснованиибит_АктОБраке(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаНачала            = Дата(1,1,1);
	ДатаОкончания         = Дата(1,1,1);
		
	ИнициализироватьБизнесПроцесс();
	
КонецПроцедуры

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаНачала = ТекущаяДатаСеанса();
	ШаблонСообщений = НСтр("ru = 'Не указан %РольСогласующего%. Указать можно в разделе НСИ и Администрирование - Продажи - Согласование';
							|en = '%РольСогласующего% is not specified. You can specify it in the ""Master data and settings — Sales – Approval"" section'");
	Если НЕ ОбщегоНазначенияУТ.ПроверитьСогласующегоБизнесПроцесс(Справочники.РолиИсполнителей.СогласующийКоммерческиеУсловияПродаж) Тогда
		ТекстСообщения = СтрЗаменить(ШаблонСообщений, "%РольСогласующего%", Справочники.РолиИсполнителей.СогласующийКоммерческиеУсловияПродаж);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ОбщегоНазначенияУТ.ПроверитьСогласующегоБизнесПроцесс(Справочники.РолиИсполнителей.СогласующийЛогистическиеУсловияПродаж) Тогда
		ТекстСообщения = СтрЗаменить(ШаблонСообщений, "%РольСогласующего%", Справочники.РолиИсполнителей.СогласующийЛогистическиеУсловияПродаж);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ОбщегоНазначенияУТ.ПроверитьСогласующегоБизнесПроцесс(Справочники.РолиИсполнителей.СогласующийФинансовыеУсловияПродаж) Тогда
		ТекстСообщения = СтрЗаменить(ШаблонСообщений, "%РольСогласующего%", Справочники.РолиИсполнителей.СогласующийФинансовыеУсловияПродаж);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ОбщегоНазначенияУТ.ПроверитьСогласующегоБизнесПроцесс(Справочники.РолиИсполнителей.СогласующийЦеновыеУсловияПродаж) Тогда
		ТекстСообщения = СтрЗаменить(ШаблонСообщений, "%РольСогласующего", Справочники.РолиИсполнителей.СогласующийЦеновыеУсловияПродаж);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ДатаЗавершения = ТекущаяДатаСеанса();
	Записать();
	
КонецПроцедуры

Процедура ОформленМастеромПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	Статус = Перечисления.бит_СтатусыОБраке.АктСформированСК;
    Записать();
КонецПроцедуры

Процедура ОформленМастеромОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.ОформленМастером;
    Записать();
	
КонецПроцедуры

Процедура бит_ВыполненРасчетМатериаловПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура бит_ВыполненРасчетМатериаловОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.ВыполненРасчетМатериаловТехнолог;
    Записать();
КонецПроцедуры

Процедура бит_ВыполненРасчетНормировщикомПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	
КонецПроцедуры

Процедура бит_ВыполненРасчетНормировщикомОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.ВыполненРасчетНормировщиком;
    Записать(); 
	
КонецПроцедуры

Процедура бит_СогласованНачальникомЦехаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);

КонецПроцедуры

Процедура бит_СогласованНачальникомЦехаОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)

	Результат = Истина; 
	Статус = Перечисления.бит_СтатусыОБраке.СогласованНачальникомЦеха;
    Записать();
	
КонецПроцедуры

Процедура бит_ОформленБухгалтеромПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);

КонецПроцедуры

Процедура бит_ОформленБухгалтеромОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.ОформленБухгалтером;
    Записать();
	
КонецПроцедуры

Процедура бит_ПереданНаКомиссиюПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);

КонецПроцедуры

Процедура бит_ПереданНаКомиссиюОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина; 
	Статус = Перечисления.бит_СтатусыОБраке.ПереданНаКомиссию;
    Записать();
	
КонецПроцедуры

Процедура бит_РассмотренНаКомиссииПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача); 
	
КонецПроцедуры

Процедура бит_РассмотренНаКомиссииОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.РассмотренНаКомиссии;
    Записать(); 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Предмет") Тогда
		
		ТипПредмета = ТипЗнч(ДанныеЗаполнения.Предмет);
		
		Если ТипПредмета = Тип("ДокументСсылка.бит_АктОБраке") Тогда
			ЗаполнитьБизнесПроцессНаОснованиибит_АктОБраке(ДанныеЗаполнения.Предмет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьБизнесПроцессНаОснованиибит_АктОБраке(ДокументОснование)
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	бит_АктОБраке.Ссылка           КАК Предмет,
		|	бит_АктОБраке.Дата КАК ДатаСогласования,
		|   ЗНАЧЕНИЕ(Перечисление.ВариантыВажностиЗадачи.Обычная) КАК Важность, 
		|	бит_АктОБраке.бит_Статус           КАК Статус,
		|	НЕ бит_АктОБраке.Проведен      КАК ЕстьОшибкиПроведен,
		|	ЛОЖЬ КАК ЕстьОшибкиСтатус
       	|ИЗ
		|	Документ.бит_АктОБраке КАК бит_АктОБраке
		|ГДЕ
		|	бит_АктОБраке.Ссылка = &ДокументОснование
		|");
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.бит_СтатусыОБраке.АктСформированСК);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.Предмет,
		Выборка.Статус,
		Выборка.ЕстьОшибкиПроведен,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
КонецПроцедуры

Процедура ИнициализироватьБизнесПроцесс()
	
	Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область Прочее
Функция СоздатьЗадачу(Знач ТочкаМаршрутаБизнесПроцесса)
	
	Задача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	
	Задача.Дата                          = ТекущаяДатаСеанса();
	Задача.ДатаНачала                    = ТекущаяДатаСеанса();
	Задача.Автор                         = Автор;
	Задача.Наименование = "Необходимо произвести дальнейшее оформление Акта о браке N" + Предмет.Номер + " от " + Предмет.Дата;
	Задача.Описание                      = Предмет.Примечание;
	Задача.Предмет                       = Предмет;
	Задача.Важность                      = Важность;
	Задача.РольИсполнителя               = ПолучитьРольИсполнителя(ТочкаМаршрутаБизнесПроцесса); 
	Задача.ОсновнойОбъектАдресации       = ТочкаМаршрутаБизнесПроцесса.ОсновнойОбъектАдресации;
	Задача.ДополнительныйОбъектАдресации = ТочкаМаршрутаБизнесПроцесса.ДополнительныйОбъектАдресации;
	Задача.БизнесПроцесс                 = Ссылка;
	Задача.СрокИсполнения                = ПолучитьСрокИсполнения();
	Задача.ТочкаМаршрута                 = ТочкаМаршрутаБизнесПроцесса;
	
	Возврат Задача; 

КонецФункции 

Функция ПолучитьИсполнителя(РольИсполнителя) 
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя";
	
	Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителя);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий(); 
		
	Возврат ВыборкаДетальныеЗаписи.Исполнитель;

	
КонецФункции

Функция ПолучитьРольИсполнителя(ТочкаМаршрута) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОчередностьЭтаповСогласований.бит_РольИсполнителя КАК бит_РольИсполнителя,
		|	бит_ОчередностьЭтаповСогласований.бит_СтатусДокумента КАК бит_СтатусДокумента,
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа КАК бит_НомерЭтапа
		|ИЗ
		|	РегистрСведений.бит_ОчередностьЭтаповСогласований КАК бит_ОчередностьЭтаповСогласований
		|ГДЕ
		|	(бит_ОчередностьЭтаповСогласований.бит_Цех = &Цех
		|			ИЛИ бит_ОчередностьЭтаповСогласований.бит_Цех = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|	И бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа";
	
	Запрос.УстановитьПараметр("Цех", Предмет.Цех);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЭтоУспешный = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Предмет.ТекущийСтатус 
			и Предмет.Статус <>  Предмет.ТекущийСтатус Тогда 
			ВыборкаДетальныеЗаписи.Следующий();
			Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента =  Предмет.Статус Тогда
				ВыборкаДетальныеЗаписи.Следующий();
               	РольИсполнителя = ВыборкаДетальныеЗаписи.бит_РольИсполнителя;
				Прервать;
			Иначе 
				ЭтоУспешный = Ложь;  
				НомерЭтапа = ВыборкаДетальныеЗаписи.бит_НомерЭтапа;
				Прервать; 			
			КонецЕсли;
		ИначеЕсли Предмет.Статус = Перечисления.бит_СтатусыОБраке.АктСформированСК 
			И ВыборкаДетальныеЗаписи.бит_СтатусДокумента =  Предмет.Статус Тогда
			  ВыборкаДетальныеЗаписи.Следующий();
              РольИсполнителя = ВыборкаДетальныеЗаписи.бит_РольИсполнителя;
              Прервать;
		КонецЕсли;
	КонецЦикла;

	
	Если не ЭтоУспешный Тогда  
		ВыборкаДетальныеЗаписи.Сбросить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.бит_НомерЭтапа = НомерЭтапа - 2 Тогда
				Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Предмет.Статус Тогда
					ВыборкаДетальныеЗаписи.Следующий();
					РольИсполнителя = ВыборкаДетальныеЗаписи.бит_РольИсполнителя;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат РольИсполнителя;

КонецФункции

Функция  ПолучитьСрокИсполнения();
	
	Если Статус = Перечисления.бит_СтатусыОБраке.АктСформированСК Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + (86400 *4));
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.ОформленМастером Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.ВыполненРасчетМатериаловТехнолог Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.ВыполненРасчетНормировщиком Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.СогласованНачальникомЦеха Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.ОформленБухгалтером Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.ПереданНаКомиссию Тогда 
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	ИначеЕсли  Статус = Перечисления.бит_СтатусыОБраке.РассмотренНаКомиссии Тогда
		Возврат  КонецДня(ТекущаяДатаСеанса() + 86400);
	КонецЕсли;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	ДатаСогласования = КонецДня(ТекущаяДатаСеанса() + 864000);  
	
КонецПроцедуры

Процедура ВыборВариантаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа КАК бит_НомерЭтапа,
		|	бит_ОчередностьЭтаповСогласований.бит_СтатусДокумента КАК бит_СтатусДокумента
		|ИЗ
		|	РегистрСведений.бит_ОчередностьЭтаповСогласований КАК бит_ОчередностьЭтаповСогласований
		|ГДЕ
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа <> 0
		|	И (бит_ОчередностьЭтаповСогласований.бит_Цех = &Цех
		|			ИЛИ бит_ОчередностьЭтаповСогласований.бит_Цех = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
		|
        |УПОРЯДОЧИТЬ ПО
		|	бит_ОчередностьЭтаповСогласований.бит_НомерЭтапа";
	
	Запрос.УстановитьПараметр("Цех", Предмет.Цех);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЭтоУспешный = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента = Предмет.ТекущийСтатус 
			и Предмет.Статус <>  Предмет.ТекущийСтатус	Тогда 
			ВыборкаДетальныеЗаписи.Следующий();
			Если ВыборкаДетальныеЗаписи.бит_СтатусДокумента =  Предмет.Статус Тогда
				ЭтапСогласования = ВыборкаДетальныеЗаписи.бит_СтатусДокумента;
				Прервать;
			Иначе 
				ЭтоУспешный = Ложь;  
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
	Если не ЭтоУспешный Тогда  
	ЭтапСогласования = Предмет.Статус;
	КонецЕсли;
		
	Если ЭтапСогласования = Перечисления.бит_СтатусыОБраке.ОформленМастером Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант2;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.ВыполненРасчетМатериаловТехнолог Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант3;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.ВыполненРасчетНормировщиком Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант4;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.СогласованНачальникомЦеха Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант5;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.ОформленБухгалтером Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант6;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.ПереданНаКомиссию Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант7;
	ИначеЕсли ЭтапСогласования = Перечисления.бит_СтатусыОБраке.РассмотренНаКомиссии Тогда
		Результат = ТочкаВыбораВарианта.Варианты.Вариант8;
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.Вариант1;
	КонецЕсли;

КонецПроцедуры

Процедура бит_ОформленМастеромОбработкаПроверкиВыполнения(ТочкаМаршрутаБизнесПроцесса, Задача, Результат)
	
	Результат = Истина;
    Статус = Перечисления.бит_СтатусыОБраке.ОформленМастером;
    Записать();
	
КонецПроцедуры

Процедура бит_ОформленМастеромПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Задача = СоздатьЗадачу(ТочкаМаршрутаБизнесПроцесса);
	ФормируемыеЗадачи.Добавить(Задача);
	Статус = Перечисления.бит_СтатусыОБраке.АктСформированСК;
    Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
